app/controllers/front/activites_controller.rb

SELECT  `sousactivites`.* FROM `sousactivites`  WHERE `sousactivites`.`activite_id` = 2  ORDER BY `sousactivites`.`id` ASC LIMIT 1
SELECT `activites`.* FROM `activites`  WHERE `activites`.`publish` = 1  ORDER BY activites.title ASC
SELECT `sousactivites`.* FROM `sousactivites`  WHERE `sousactivites`.`activite_id` = 2 AND `sousactivites`.`publish` = 1  ORDER BY sousactivites.title ASC
---
  def show
    @activite = Activite.friendly.find(params[:id])
    raise ActiveRecord::RecordNotFound unless @activite.publish

    if params[:sousactivite]
      begin
        @sousactivite = Sousactivite.friendly.find(params[:sousactivite])
        if @sousactivite.activite != @activite
          @sousactivite = @activite.sousactivites.first