app/controllers/front/indexs_controller.rb

SELECT `activites`.* FROM `activites`  WHERE `activites`.`publish` = 1  ORDER BY activites.title ASC
---
  def index

    @news = New.scope_published(true).order("news.created_at DESC").page(1).per(5)
    @activite = Activite.scope_published(true).order("title")