app/controllers/front/indexs_controller.rb

SELECT  `news`.* FROM `news`  WHERE `news`.`publish` = 1  ORDER BY news.created_at DESC LIMIT 10 OFFSET 0
---
  def index

    @news = New.scope_published(true).order("news.created_at DESC").page(1).per(10)