app/controllers/front/news_controller.rb

SELECT `news`.* FROM `news`   ORDER BY news.created_at DESC
---
  def index
    @news = New.order("news.created_at DESC")