app/controllers/back/activites_controller.rb

SELECT  `activites`.* FROM `activites`   ORDER BY activites.title ASC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `activites`
---
  def index
    @activites = Activite.order("activites.title ASC").filter(get_params).page(params[:page]).per(5)