app/controllers/back/news_controller.rb

  def index
    @news = New.order("news.created_at DESC").filter(get_params).page(params[:page]).per(5)
---
SELECT  `news`.* FROM `news`   ORDER BY news.created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `news`

  def set_new
    @new = New.find(params[:id])
---
SELECT  `news`.* FROM `news`  WHERE `news`.`id` = 4 LIMIT 1