app/controllers/back/sousactivites_controller.rb

SELECT `sousactivite_images`.* FROM `sousactivite_images`  WHERE `sousactivite_images`.`sousactivite_id` = 9
---
  def update

    respond_to do |format|
      # Then, delete images that are deleted
      @sousactivite.sousactivite_images.each do |sousactivite_image|

SELECT  `activites`.* FROM `activites`  WHERE `activites`.`id` = 2 LIMIT 1
SELECT  `sousactivites`.* FROM `sousactivites`  WHERE `sousactivites`.`id` = 9 LIMIT 1
---
  def set_sousactivite
    @sousactivite = Sousactivite.find(params[:id])