app/views/front/menus/_menu.html.erb

SELECT `sousactivites`.* FROM `sousactivites`  WHERE `sousactivites`.`activite_id` = 2
---
			<ul class="dropdown">
			<% activite.sousactivites.each do |sousactivite| %>