app/views/front/menus/_menu.html.erb

SELECT `activites`.* FROM `activites`  WHERE `activites`.`publish` = 1  ORDER BY activites.title ASC
---
			<ul class="dropdown">
			<% activite.sousactivites.scope_published(true).order("title").each do |sousactivite| %>