app/views/front/activites/_submenu.html.erb

SELECT `sousactivites`.* FROM `sousactivites`  WHERE `sousactivites`.`activite_id` = 2 AND `sousactivites`.`publish` = 1  ORDER BY sousactivites.title ASC
---
<ul class="center">
  <% activite.sousactivites.scope_published(true).order("sousactivites.title ASC").each do |sousactivite| %>